<?php

namespace Database\Seeders;

use App\Models\Problem;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProblemSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Problem::truncate();

        $problems = [
            'ক্ষুদে শ্যামা',
            'বড় শ্যামা',
            'বড় চেচড়া',
            'ছোট চেচড়া',
            'পানি কচু',
            'পানি লং',
            'পানি মরিচ',
            'উলু',
            'দুধিয়া',
            'বর চুচা',
            'আঙ্গুলি ঘাস',
            'শুষনি শাক',
            'দূর্বা ঘাস',
            'কাটানটে',
            'কানাইবাশি',
            'ঝিল মরিচ ',
            'নুনিয়া',
            'এরাইল',
            'মুথা',
            'হলদে মুথা',
        ];

        $problemsData = [];
        foreach ($problems as $problem) {
            $problemsData[] = ['name' => $problem, 'type' => 'weeds'];
        }
        Problem::insert($problemsData);

        $problems = [
            'ধানের মাজরা পোকা',
            'ধানের গল মাছি বা নলি মাছি',
            'ধানের বাদামী গাছ ফড়িং ',
            'ধানের সবুজ পাতা ফড়িং',
            'ধানের পাতা মোড়ানো পোকা',
            'ধানের গান্ধী পোকা',
            'ধানের লম্বা শুঁড় উরচুঙ্গা পোকা',
            'ধানের ছাতরা পোকা',
            'ধানের থ্রিপস পোকা',
            'ধানের লেদা পোকা',
            'ধানের পাতা মাছি',
            'ধানের পামরী পোকা',
            'ধানের চুঙ্গী পোকা',
            'ধানের শীষ কাটা লেদা পোকা',
            'আলুর জাব পোকা',
            'আলুর কাটুই পোকা',
            'আলুর পাতা সুড়ঙ্গকারী পোকা',
            'আলুর সুতলী পোকা',
            'আলুর ফ্লি বিটল',
            'টমেটোর সাদা মাছি',
            'টমেটোর ফল ছিদ্রকারী পোকা',
            'টমেটোর পাতা সুরঙ্গকারী পোকা',
            'বেগুন পাতার জেসিড',
            'বেগুনের ডগা ও ফল ছিদ্রকারী পোকা',
            'বেগুনের জাব পোকা',
            'ঢেঁড়সের ডগা ও ফল ছিদ্রকারী পোকা',
            'মিস্টি কুমড়ার লাল বিটল পোকা',
            'মিস্টি কুমড়ার থ্রিপ্স পোকা',
            'মাছি পোকা',
            'শিমের জাব পোকা',
            'শিমের ফল ছিদ্রকারী পোকা',
            'মরিচের থ্রিপস',
            'মরিচের ফল ছিদ্রকারি পোকা',
            'মরিচের জাব পোকা',
            'মরিচের লাল মাকড়',
            'পেয়াজের কাটুই পোকা',
            'মাকড়',
            'পেয়াজে্র ঘোড়া পোকা',
            'রসুনের লেদা পোকা',
            'রসুনের পাতা মোড়ানো পোকা',
            'সয়াবিনের জাব পোকা',
            'সয়াবিনের ফল ছিদ্রকারী পোকা',
            'সরিষার কাটুই পোকা',
            'সরিষার জাব পোকা',
            'সরিষার করাত মাছি পোকা',
            'ভুট্টার ফল আর্মি ওয়ার্ম',
            'ভুট্টার কাটুই পোকা',
            'ভুট্টার কান্ডের মাজরা পোকা',
            'আমের হপার পোকা',
            'আমের ফল ছিদ্রকারী পোকা',
            'সাদা মাছি',
            'ছাতরা পোকা',
        ];
        $problemsData = [];
        foreach ($problems as $problem) {
            $problemsData[] = ['name' => $problem, 'type' => 'insect'];
        }
        Problem::insert($problemsData);

        $problems = [
            'ধানের ব্লাস্ট রোগ',
            'ধানের খোলপড়া রোগ',
            'ব্যাকটেরিয়া জনিত পাতা পোড়া রোগ বা ব্যাকটেরিয়াল লিফ ব্লাইট (বি এল পি)',
            'ধানের লক্ষির গু বা ভুয়া ঝুল বা ফলস স্মাট',
            'বাকানি বা গোড়া পচা রোগ',
            'ধানের পাতার লালচে রেখা রোগ',
            'ধানের উফরা রোগ',
            'ধানের বাদামী দাগ রোগ',
            'ধানের খোল পচা রোগ',
            'ধানের টুংরো রোগ ',
            'ধানের পাতা ফোস্কা রোগ ',
            'আলুর অন্তর ফাঁপা রোগ',
            'আলুর নাবি ধ্বসা',
            'আলুর আগাম ধ্বসা ',
            'আলুর শুকনো পচা রোগ ',
            'আলুর ঢলে পড়া রোগ',
            'আলুর পাউডারী মিলডিউ',
            'আলুর কালো বা নরম পচা রোগ',
            'বেগুনের ঢলে পড়া রোগ',
            'বেগুনের ক্ষুদে পাতা বা গুচ্ছ পাতা রোগ',
            'পাউডারি মিলডিউ রোগ বা সাদা দাগ রোগ',
            'ডাউনি মিলডিউ বা দাগ রোগ',
            'ঢলে পড়া রোগ',
            'টমেটোর নাবি ধ্বসা রোগ',
            'টমেটোর পাতা কোঁকড়ানো রোগ',
            'শিমের পচা রোগ',
            'মরিচের পচা রোগ',
            'মরিচের কান্ড পচা রোগ ',
            'পেঁয়াজের পার্পল ব্লোচ রোগ',
            'পেঁয়াজের গলা ও কন্দ পচা রোগ',
            'সরিষার অল্টারনারিয়া ব্লাইট',
            'সয়াবিনের পাতার রাস্ট বা মরিচা ধরা রোগ',
            'ভুট্টার কান্ড পচা রোগ ',
            'ভুট্টার পাতা ঝলসানো রোগ',
            'ভুট্টার মোচা ও দানা পচা রোগ',
            'ফুলকপির পাতায় দাগ রোগ',
            'ফুলকপির কার্ড ও গোড়া পচা রোগ',
            'বাধাকপির পাতায় দাগ রোগ',
            'বাধাকপির পাতায় ব্লাইট রোগ',
            'সবজির নেতিয়ে পড়া রোগ',
            'ভাইরাসজনিত মোজাইক রোগ',
            'পাতা কোকড়ানো রোগ',
        ];
        $problemsData = [];
        foreach ($problems as $problem) {
            $problemsData[] = ['name' => $problem, 'type' => 'disease'];
        }
        Problem::insert($problemsData);
    }
}
