<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $products = [
                'সিনোজিপ (জিপসাম সার)',
                'প্রেস্টিজ ২০ এস এল',
                'ইপ্রোটিন ১.৮ ই সি',
                'এজেন্ট ৫০৫ ই সি',
                'রোটা ২.৫ ই সি',
                'ইপ্রোমার ২০ এস এল',
                'কারেন্ট ৭০ ডব্লিউ পি',
                'অডি ৬ ডব্লিউ ডি জি',
                'সুজিম ৫০ ডব্লিউ পি',
                'পাতাবাহার',
                'সিনোরন ১০ ডব্লিঊ পি',
                'পেন্টালিন ৩৩ ই সি',
                'কেরি ৩০ ডব্লিউ পি',
                'এভারেস্ট ৫ এস. জি.',
                'প্রোগ্রেস ১৮০ এস. সি.',
                'মটো ২৫ ডব্লিউ ডি জি',
                'ফিলটাপ ৫০ এস পি',
                'এনাইট্রোজিন ৮০ ডব্লিঊ ডি জি',
                'এভিশন ৪০ ডব্লিউ ডি জি',
                'চেলসিড ৫০ এস সি',
                'ডোভার ২৮ এস সি',
                'লিডো ৪ ই সি',
                'সিনোবরিক (বোরণ সার)',
                'সিনোবোর (সলুবোর বোরণ সার)',
                'হীরা গোল্ড পি জি আর',
                'হীরা ম্যাজিক',
                'ডায়মেনশন ৭৫ ডব্লিউ জি',
                'বন্ড ২৫০ ই সি',
                'ব্যাকট্রল ২০ ডব্লিউ পি',
                'এরিষ্টোডিয়ন ৫০ ডব্লিউ পি',
                'ফ্লাশ ৫ ই সি',
                'ফিলথেন এম ৪৫',
                'সিনোজেব ৮০ ডব্লিউ পি',
                'পাপা ৭২ ডব্লিউ পি',
                'সাইফার ৮০ ডব্লিউ ডি জি',
                'ভেলিমেক্স ২৫ ই ডব্লিউ',
                'শেল্টার ৫২.৫ ডব্লিউ পি',
                'গ্লাইফোসেট ৪১ এস এল',
                'জাজিরা ৭২ এস এল',
                'অ্যাট্রন ৫৫ এস এল',
                'ফ্যাসিনেট ২০ এস এল',
                'সিনো জিংক হেপ্টা',
                'সিনো জিংক মনো',
                'হীরা চ্যাম্পিয়ন',
                'হীরা মিক্স',
            ];
        foreach($products as $product){
            Product::create([
                'name' => $product,
            ]);
        }
    }
}
